Tekla Open API Reference for Tekla Structures 2025
AnalysisPartPositionProperties.AxisLocation Property
 The axis location of the analysis part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartPositionProperties.AxisLocationEnum AxisLocation { get; set; }
Public Property AxisLocation As AnalysisPartPositionProperties.AxisLocationEnum
	Get
	Set
Property Value
Type: AnalysisPartPositionProperties.AxisLocationEnum
See Also
Reference
AnalysisPartPositionProperties Class
Tekla.Structures.Analysis Namespace